frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_timer.c
/*!
    \brief      get timer interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0..2,5,6,13..16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag, TIMERx(x=0..2,14)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag, TIMERx(x=0..2)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag, TIMERx(x=0..2)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,14..16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0..2,14)
      \arg        TIMER_INT_FLAG_BRK: break interrupt flag, TIMERx(x=0,14..16)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t interrupt)
{
    uint32_t val;
    val = (TIMER_DMAINTEN(timer_periph) & interrupt);
    if((RESET != (TIMER_INTF(timer_periph) & interrupt) ) && (RESET != val)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear TIMER interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0..2,5,6,13..16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag, TIMERx(x=0..2,14)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag, TIMERx(x=0..2)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag, TIMERx(x=0..2)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,14..16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0..2,14)
      \arg        TIMER_INT_FLAG_BRK: break interrupt flag, TIMERx(x=0,14..16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)interrupt);
}

/*!
    \brief      get TIMER flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0..2,5,6,13..16)
      \arg        TIMER_FLAG_CH0: channel 0 flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_FLAG_CH1: channel 1 flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_CH2: channel 2 flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CH3: channel 3 flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CMT: channel control update flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_BRK: break flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0..2)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    if(RESET != (TIMER_INTF(timer_periph) & flag)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear TIMER flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0..2,5,6,13..16)
      \arg        TIMER_FLAG_CH0: channel 0 flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_FLAG_CH1: channel 1 flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_CH2: channel 2 flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CH3: channel 3 flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CMT: channel control update flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_BRK: break flag, TIMERx(x=0,14..16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0..2,13..16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0..2,14)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0..2)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0..2)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)flag);
}
